### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_sqs_queue.terraform_queue will be created
+   resource "aws_sqs_queue" "terraform_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 91
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 2048
+       message_retention_seconds         = 86400
+       name                              = "terraform-codely-queue"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 10
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = (known after apply)
+       tags                              = {
+           "Environment" = "pre"
        }
+       tags_all                          = {
+           "Environment" = "pre"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>